In [102]:
################ Indexes
# Set, Reset and Sort Index

In [103]:
# Create dataframe from dictionary
import pandas as pd
dict={
    "f_name":["Sony","Pragya","Prasanna","Ram","Hari","Sita"],
    "l_name":["Shrestha","Shrestha","Shrestha","Prasad","Kumar","Giri"],
    "age":[24,27,19,24,27,19]
}
df=pd.DataFrame(dict)
df

    f_name    l_name  age
0     Sony  Shrestha   24
1   Pragya  Shrestha   27
..     ...       ...  ...
4     Hari     Kumar   27
5     Sita      Giri   19

[6 rows x 3 columns]

In [104]:
df.set_index("f_name")

          l_name  age
f_name
Sony    Shrestha   24
Pragya  Shrestha   27
...          ...  ...
Hari       Kumar   27
Sita        Giri   19

[6 rows x 2 columns]

In [105]:
df

    f_name    l_name  age
0     Sony  Shrestha   24
1   Pragya  Shrestha   27
..     ...       ...  ...
4     Hari     Kumar   27
5     Sita      Giri   19

[6 rows x 3 columns]

In [106]:
df.set_index("f_name",inplace=True)

In [107]:
df

          l_name  age
f_name
Sony    Shrestha   24
Pragya  Shrestha   27
...          ...  ...
Hari       Kumar   27
Sita        Giri   19

[6 rows x 2 columns]

In [108]:
df.index

Index(['Sony', 'Pragya', 'Prasanna', 'Ram', 'Hari', 'Sita'], dtype='object', name='f_name')

In [112]:
df.loc["Sony"]

l_name    Shrestha
age             24
Name: Sony, dtype: object

In [113]:
df.loc["Sony":"Hari"]

            l_name  age
f_name
Sony      Shrestha   24
Pragya    Shrestha   27
Prasanna  Shrestha   19
Ram         Prasad   24
Hari         Kumar   27

In [115]:
# Reset Index
df.reset_index()
df

          l_name  age
f_name
Sony    Shrestha   24
Pragya  Shrestha   27
...          ...  ...
Hari       Kumar   27
Sita        Giri   19

[6 rows x 2 columns]

In [126]:
# Reset Index
df.reset_index(inplace=True)
df

    f_name    l_name  age
0     Sony  Shrestha   24
1   Pragya  Shrestha   27
..     ...       ...  ...
4     Hari     Kumar   27
5     Sita      Giri   19

[6 rows x 3 columns]

In [127]:
df.set_index("f_name",inplace=True)
df.sort_index()
df.sort_index(ascending=False,inplace=True)

In [128]:
df

          l_name  age
f_name
Sony    Shrestha   24
Sita        Giri   19
...          ...  ...
Pragya  Shrestha   27
Hari       Kumar   27

[6 rows x 2 columns]